finishLoad();
newsListList=`
    <div class="width zhuanlan-top">
    <h1>春潮专栏 第二辑</h1>
    </div>
    <div class="width zhuanlan-box" id="zhuanlan-box1">
		<a onclick="goN(1255)">2025新年献词 | 愿人生中的每段旅程，都有故事娓娓可道<au>编辑部</au><ti>2024-12-31</ti></a>
		<a onclick="goN(1253)">故乡的天空<au>Abel</au><ti>2024-10-26</ti></a>
		<a onclick="goN(1246)">2024新年献词 | 像流水一样不再回头<au>编辑部</au><ti>2023-12-31</ti></a>
		<a onclick="goN(1242)">写在没有疫情的第一个冬天<au>豆腐泡杀手</au><ti>2023-11-08</ti></a>
		<a onclick="goN(1238)">《不止不休》：黄金年代理想主义的挽歌<au>杨二狗</au><ti>2023-03-30</ti></a>
		<a onclick="goN(1237)">葬尸湖<au>307</au><ti>2023-03-23</ti></a>
	</div>
	<div class="width zhuanlan-box" id="zhuanlan-box2">
		<a onclick="goN(1236)">疫年整<au>上司几太</au><ti>2023-03-08</ti></a>
		<a onclick="goN(1235)">2023新年献词 | 告别未来十年里最好的一年<au>编辑部</au><ti>2022-12-31</ti></a>
		<a onclick="goN(1234)">当我们告别行程卡时，我们在告别什么<au>上司几太</au><ti>2022-12-13</ti></a>
		<a onclick="goN(1233)">祝你这个冬天快乐<au>铁柱</au><ti>2022-12-09</ti></a>
		<a onclick="goN(1232)">等待尘烟散去<au>给你一拳</au><ti>2022-11-19</ti></a>	   
		<a onclick="goN(1231)">写在疫情时代的第四个冬天<au>豆腐泡杀手</au><ti>2022-11-16</ti></a>
	</div>
	<button id="zhuanlan-morebtn" onclick="zhuanlan_more();">加载更多...</button>
`;
function newsInfoInfo() {
	switch(nid) {
	case '1255':
		newsCC=`
		<author onclick="goN(0021)">杨二狗</author>
		<p>五年前的今夜，不知道你是否和许多人一样，正带着欢欣和期待迎接二十年代的到来。那时候，区块链和刷脸支付还是新兴技术，5G概念被认为是下一个十年最大的风口，短视频社交正在广泛的普及，勾连起碎片化的日常，也在不知不觉间为每个人的生活按下了快进键。</p><p>恍惚之后，时间滴答流转，像一条缓缓流动的河，不动声色，也不可阻挡。五年过去了，在今天这个与平常无异的星期二，似乎直到看见日历上的12月31日，才能在隐约间感受到那种淡淡的新意——新的依旧。是啊，这个世界的脚步依旧，丝毫没有停下来等等那些活在过去的人的想法。人们的面孔依旧，也不过多了些岁月的痕迹，少了些盲目的激情。最重要的是，生活还在依旧，匆匆地踏着如往日般的喧嚣，在忙碌与倦怠之间从未停歇。</p><p>再一次站在旧与新交替的节点，新十年的上半篇终于翻开了最后一页。看起来这个世界是想给我们展示些新的变化的：这一年里，我们看到技术以令人生畏的速度发展，不断突破着壁垒的上限；也看到社会生活的瞬息万变，战争迫害侵蚀着文明的下限。我们看到国际政治的潮水起伏和暗流涌动——有人在枪声响起后重返顶峰，也有人在黑夜的风暴中黯然离场。我们还看到世道浇漓、人心不古——在青春肆意的年华被暴力的铁铲掩埋成沉重的叹息，在最需要爱和保护的年纪被最亲近的人夺去幼小的生命。</p><p>尽管世界自有其沟壑，有人还在努力填补：当贵阳中院判处人贩子余华英死刑，当巴勒斯坦各派签署《北京宣言》，当麦子阿姨的南行之路终于启程，他们都在用每一个微小的努力推动着改变。因为注定已经无法回到过去，所以才更加希望每一个今天和明天，都能弥补那些曾经遗失的温暖和正义。</p><p>人的轨迹，总是与时代的洪流交织。今年，考研人数接近440万，考公大军首次突破300万。你是否参与其中，或待来年跃跃欲试？哈尔滨的雪、阿勒泰的极光、黑神话里的山西成功出圈，你是否在忙碌的生活中也偶尔会停下脚步，去看看那些美丽的风景，回应那些远方的呼唤？</p><p>有人说，生命之意义就在于死去前的每一个瞬间。将人生的每一个阶段、每一场经历都看作是一段旅程，那我们的生命不过只是行程之中的各种计划、体验、回味而已。在迷失之后，放下又拾起；在经历之后，相遇又别离；在疲惫之后，前路又清晰。</p><p>几个小时之后，新年的阳光将再次照耀每一个人。也许会有人为此欢呼，而更多人只是望向窗外，任由晨光将过去一年里的一切悄然包裹。因为他们明白，无论时间如何流转，日子如何更迭，那些人生旅程中留下的故事，都将成为岁月的底色，照亮前方那无数个未知的明天。</p><p>当然，在旅程途中，我们总希望要找到些可以铭记的故事，以供回首时可以娓娓道来。</p><p>2025，新年快乐，祝你祝我。</p>
		`;
		basI('2025新年献词 | 愿人生中的每段旅程，都有故事娓娓可道',2024,12,31);
		break;
	case '9002':
		newsCC=`
		<p><br/>新年献词专题页面：<a href="/jbwz/xnxc" target="_blank">http://spride.asia/jbwz/xnxc</a></p>
		`;
		basI('新年献词专题页面',2303,12,99);
		break;
	default:
		window.location.href="#/index/404";
		break;
	}
}
