finishLoad();
newsListList=`
    <div class="title-bg">
        <div class="width title">
		    <h1>新闻公告</h1><p>News & Notices</p>
	    </div>
    </div>
    <div class="width news-newstyle">
        <br/><br/><br/>
	    <a onclick="goN()"><s>标题和内容已删除【选择保留发表记录】</s><t>2023/09/10</t></a>
	    <a onclick="goN()"><s>标题和内容已删除【选择保留发表记录】</s><t>2023/07/02</t></a>
	    <a onclick="goN()"><s>标题和内容已删除【选择保留发表记录】</s><t>2022/12/16</t></a>
	    <a onclick="goN()"><s>标题和内容已删除【选择保留发表记录】</s><t>2022/11/20</t></a>
	    <a onclick="goN()"><s>标题和内容已删除【选择保留发表记录】</s><t>2022/01/05</t></a>
	    <a onclick="goN(1060)"><s>【科普】95后的童年都被这个网站承包了，但你知道它的底色是**和黄*？</s><t>2021/08/18</t></a>
	    <a onclick="goN()"><s>标题和内容已删除【选择保留发表记录】</s><t>2021/01/21</t></a>
	    <br/><br/><br/><br/>
    </div>
`;
function newsInfoInfo() {
	switch(nid) {
	case '1060':
		newsCC=`<p>今年六一，摩尔庄园以手游的形式强势回归，让不少95后都前去体验一把，想找回童年的感动和快乐。不知道有多少人曾和我一样，多年前的假期，总是坐在电脑面前，进入摩尔的世界，打理着自己的庄园，偶尔去带上拉姆去商店街逛逛，偶尔约上三五好友一起游戏厅里PK，期待着每周五准时更新的任务。优秀的小玩家通过自己摸索就能达成任务，一些追求速度的小玩家，则会选择参照攻略。而当时游戏攻略最齐全、最有速度优势的，当属4399了。</p>
<p>4399作为一款游戏聚合网站，凭借丰富的游戏资源迅速占领中国的页游市场，再通过当时的主流网页hao123导流，4399的访问量能达到上百万。《摩尔庄园》与《赛尔号》的入驻，更是吸引了大批低龄用户入驻。在短短几年的时间里，4399就收获了超四亿的注册用户，十亿元的营收，坐实了当时页游的榜首地位，连如今的某讯某易，都曾败在它手下。但是，历史的经验也告诉我们，往往越是掘金疯狂的，其背后也会越不单纯呢...</p>
<p>摩尔庄园最初以“孩子开心，家长放心”的游戏理念及防沉迷系统赢得了家长的信任，一度成为孩子们休闲娱乐的首选。然而，和众多商业网站一样，淘米网在利益的驱使下忘记了初心，逐渐变质。超级拉姆这一付费体系有诱导未成年人消费之嫌，经媒体报道后，《摩尔庄园》的良好形象也在家长面前溶解，成为后期没落的一大因素。</p>
<p>同样的，4399的背景也并非像那些游戏带给我们的快乐般美好，它的辉煌其实是建立在盗版和黄暴类游戏的运营和打造之上的。在Flash盛行的当时，4399的游戏库，主要依靠Flash制作的小游戏支撑，除此之外，便是盗版游戏了。在上线的短短几年时间里，4399平台上就有上万个，仅靠游戏爱好者自制，显然是难以达成这样的数据。据业内人士透露，4399内部有一支专门破解正版游戏的团队，俗称“扒游戏”，他们能在短时间内破解海内外热门游戏，并迅速搬到4399平台上。在法律意识薄弱的当时，这一行为并未得到用户的举报，而国外的游戏开发者，也是投诉无门，只能眼睁睁看着自己的知识产权被盗。</p>
<p>比较知名的，应当属于《黄金矿工》了。这款经典中的经典益智游戏能在国内火起来，也许真的要感谢4399。但鲜为人知的是，这款游戏其实是国外一家名为GameRival的公司开发的，而4399未经制作方的允许，就擅自破译搬到国内，严重损害了制作方的权益。除去这些搬运的游戏，4399自主研发的游戏，也逃不开“侵权”这一事。</p>
<p>在国内，游戏大厂某易也陷入过版权危机中。4399运营的一款名为《仙语》的游戏，被发现大量抄袭网易游戏旗下的《梦幻西游》，2017年7月，被网易以涉嫌侵权为由，将4399告上法庭，并最终胜诉。10月，网易和暴雪联合讼诉4399旗下的《英雄枪战》和《枪战前线》抄袭《守望先锋》，同样胜诉。就连一直“借鉴”别人的某讯，也被4399“借鉴”了。《格斗猎人》是4399推出的一款3D横版格斗手游，因角色设计和玩法与腾讯旗下的DNF极度相似，也被腾讯告上法庭。</p>
<p>被曾经不屑一顾的对手接连起诉，4399承受经济损失的同时，口碑也迅速下滑。4399的侵权行为一度成为玩家们热议的话题，以此为导火线，4399过去的一些负面信息，也浮出水面。4399游戏种类繁多，自然不乏一些黄色暴力游戏。在4399创立的00年代，互联网仍属于新鲜事物，相关部门对网络的审核和管理仍未形成相应的体现，这类黄色暴力游戏也因此盛行，成为不少90后的黄暴启蒙。</p>
<p>相信你也一定听说过“狂扁小朋友”这款游戏。玩家通过操作一个“紫色巨汉”的角色，殴打公园里的小孩，也可以利用场景内的不同道具提高伤害。一局游戏下来，能把平时积累的压力也一扫而空。《拳皇》算是众90后的童年回忆了，作为日本知名的街机游戏，4399自然没有放过这款炙手可热的游戏，把它也移植到自己的平台上。世界各地的格斗专家齐聚一堂，相互搏斗以证明自己的实力，也算是不少人的暴力美学启蒙了。除了暴力，黄色游戏或者说猎奇游戏在4399平台上也能占有一席之地。点入“女生”、“休闲”这类栏目，除了一些换装、做菜游戏，还可能会夹杂着一些类似“手术”、“医疗”等小游戏，其猎奇程度被称为童年阴影也不为过。</p>
<p>虽说在网管部门的严厉打击下，这类游戏早已被下线查封，而细想，承载我们一代人记忆的4399，也并非建立在光彩之上，盗版游戏泛滥，黄爆游戏盛行，仿佛给我们的童年蒙上一层厚重的阴影，一个罪恶感也油然而生。</p>
<p>虽然4399的盗版行为和黄暴游戏确实让人震惊，但它也为此付出了应有的代价，那些曾经带给我们的欢乐，仍在我们心中，闲暇时细细回想，总是甘苦交加。每个童趣的背后其实都有不齿的过往，只是小时的我们从未想过去触碰那些隐藏在背后的黑暗面。童年不再，但欢乐尚存，当我想起那些年在4399和小伙伴们一同玩耍的日子时，想起每到电脑课的时候PC荧幕一致打开4399网页的场景时，我都会忍不住的嘴角上翘，获得满满的欣慰之情。</p>
<p>从盗版的逆境中起步的，不止4399，那个Z世代最受欢迎的交流平台，也有相似的过往（你们猜猜我说的是谁，可以将答案写到评论区）。只不过后者如今已然成为了一方巨擘，也收获到数百亿美金的市值了。也许在不久的将来，4399也能和它一样，找到自己的道路，为我们带来不一样的感动。</p>`;
		basI('【科普】95后的童年都被这个网站承包了，但你知道它的底色是**和黄*？',2021,8,18);
		break;
	default:
		window.location.href="#/index/newsList";
		break;
	}
}
